{
  "workExperience": [
    {
      "logo": "/assets/images/letsai-logo.png",
      "title": "AI Engineer Intern",
      "company": "LetsAI Solutions",
      "start_date": "Mar 2025",
      "end_date": "Present",
      "roledesc": "Enhancing enterprise-grade agentic AI systems by customizing frameworks like CrewAI, Autogen, and Langflow with modular components and control layers to support scalable, client-specific solutions. Building intelligent agent workflows using Langflow, FastAPI, PostgreSQL, Chroma, MCPs, Composio, and LLMs to deliver flexible, production-ready architectures. Exploring and integrating no-code/low-code platforms to accelerate development and enable non-technical teams to contribute effectively. Managing backend infrastructure, implementing LLM observability and traceability, and optimizing pipelines to improve performance, decision transparency, and reliability in multi-agent environments.",
      "skills": ["Python", "FastAPI", "CrewAI", "Autogen", "Langflow", "ChromaDB", "PostgreSQL", "Alembic"]
    },
    {
      "logo": "/assets/images/evva-logo.png",
      "title": "AI Engineer Intern",
      "company": "Evva Health",
      "start_date": "Oct 2024",
      "end_date": "Mar 2025",
      "roledesc": "Led end-to-end development of scalable multi-agent AI systems using FastAPI, Python, LLMs, and vector databases, delivering modular, high-performance solutions for healthcare and surveying. Designed and deployed multimodal AI assistants with voice and text interfaces, reducing response latency by 28% and enhancing real-time engagement through optimized agent architecture. Optimized intelligent agents for behavior tracking and personalized content generation, cutting LLM costs by 12% via prompt optimization and model routing while boosting user retention. Automated extraction of healthcare insights from trusted sources like ClinicalTrials.gov and Amazon to generate accurate, user-centric care plans with minimal manual input. Authored comprehensive technical documentation covering APIs, agent behaviors, and backend systems to streamline onboarding, collaboration, and maintainability.",
      "skills": ["Python", "FastAPI", "MongoDB", "PostgreSQL", "OpenAI API", "Playwright", "ScrapeGraphAI"]
    }
  ]
}